app/controllers/api/v1/battles_controller.rb

  def index
    @battles = Battle.all
---
SELECT "battles".* FROM "battles"

  def show
    battle = Battle.find(params[:id])
---
SELECT  "battles".* FROM "battles" WHERE "battles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def create
    battle = Battle.new(battle_params)
    if battle.save
---
INSERT INTO "battles" ("name", "year", "location", "winner", "creator_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "The Battle of the Mossman"], ["year", "2011"], ["location", "Needham, Ma"], ["winner", "The Mossman"], ["creator_id", 1]]