app/controllers/api/v1/comments_controller.rb

SELECT  "battles".* FROM "battles" WHERE "battles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."battle_id" = $1  [["battle_id", 10]]
---
  def index
    comments = Battle.find(params[:battle_id]).comments